import css from './css.module.css'

export const Cookies = ()=> {
    return (
        <div className={css.wrapper}>
            <h2>ПОЛИТИКА ИСПОЛЬЗОВАНИЯ ФАЙЛОВ «COOKIES»</h2>

            <div>
                Настоящая Политика использования файлов «Сookies» (далее — «Политика») разработана и действует в
                отношении файлов «Сookies», которые используются на сайте https://адрес39.рф/ (далее – «Сайт»). Политика
                определяет порядок и условия обработки файлов «Cookies», собираемых и используемых посредством Сайта.
            </div>
            <div>
                Файлы «Cookies» представляют собой небольшие фрагменты информации, которые размещаются или могут быть
                сохранены на Вашем компьютере (или других Интернет-совместимых устройствах, таких как смартфон или
                планшет), в браузере или на просматриваемой веб-странице, когда Вы посещаете Сайт.
            </div>
            <div>Файлы «Cookies» используются с целью улучшения работы Сайта, повышения удобства и эффективности работы
                с Сайтом, улучшения его защиты, для сбора и анализа информации о производительности и использовании
                Сайта, количестве посещений на Сайте, а также для улучшения и индивидуальной настройки предоставления
                информации, повышения степени удовлетворенности работой Сайта, для обеспечения технических возможностей
                полноценного функционирования Сайта, для персонализации контента и сообщений, сбора аналитики и других
                целей.
            </div>
            <div>Более подробную информацию о файлах «Сookies» и принципах их работы можно найти на ресурсе
                <a href={'http://www.aboutcookies.org/.'} target={'_blank'}>http://www.aboutcookies.org/.</a>
            </div>
            <div>При посещении Сайта предоставляется баннер, информирующий об использовании файлов «Cookies» и
                запрашивающий Ваше согласие на использование файлов «Cookies». Нажав кнопку «Хорошо» или продолжая
                использовать Сайт (продолжая находиться на Сайте), Вы соглашаетесь на использование, сбор и размещение
                файлов «Cookies» на Вашем компьютере или ином устройстве, в браузере или на просматриваемой
                веб-странице.
            </div>
            <div>В случае отказа от использования и обработки файлов «Сookies», Вы проинформированы о необходимости
                прекратить дальнейшее использование Сайта или отключить использование файлов «Cookies».
            </div>
            <div>Использование файлов «Cookies» может быть отключено в интернет-обозревателе (в настройках браузера).
                Поскольку средства, с помощью которых можно отказаться от использования/сбора файлов «Сookies» через
                элементы управления браузера, отличаются в зависимости от браузера, для получения дополнительной
                информации следует обратиться к разделу «Справка» используемого браузера или иным соответствующим его
                разделам. При отключении использования файлов «Cookies» возможность использования Сайта сохраняется,
                однако могут быть недоступны или ограничены некоторые функции и(или) веб-страницы Сайта.
            </div>
            <div>Используются два вида файлов «Cookies»:
            </div>
            <div>- временные (сессионные), которые существуют только во время нахождения на странице Сайта, срок действия
                которых истекает (и они удаляются) после закрытия интернет-обозревателя (браузера);

            </div>
            <div>- постоянные (бессрочные), которые удаляются по истечении установленного срока хранения (или через
                определенный промежуток времени) либо хранятся без ограничения срока и при необходимости могут быть
                удалены в любое время пользователем из его компьютера или иного устройства.
            </div>
            <div>В Политику использования файлов «Сookies» периодически могут вноситься изменения или дополнения, в
                связи с чем рекомендуется время от времени вновь осуществлять ознакомление с положениями настоящей
                Политики, в том числе для понимания условий и способов использования файлов «Сookies».
            </div>

        </div>
    )
}