import css from './css.module.css'

export const Terms = ()=> {
    return (
        <div className={css.wrapper}>
            <h2>Политика конфиденциальности сайта Адрес 39</h2>
            <div>
                <h3>1. Общая информация</h3>
                Настоящая Политика конфиденциальности определяет порядок сбора, использования и защиты персональных
                данных пользователей сайта ресторана `Адрес 39`, расположенного по адресу: Москва, проспект Маршала
                Жукова, 39А, корп. 1. Контактный телефон: +7 (985) 039-00-39.
            </div>
            <div>
                <h3>2. Собираемые данные</h3>
                При оформлении заказа на сайте мы собираем следующую информацию:

                Имя и фамилия пользователя;

                Номер телефона;

                Адрес доставки.
            </div>
            <div>
                <h3>3. Цели сбора и использования данных</h3>
                Собранные данные используются исключительно для следующих целей:

                Обработка и выполнение заказа;

                Связь с пользователем по вопросам заказа;

                Доставка заказанной продукции.
            </div>
            <div>
                <h3>4. Использование и защита данных</h3>

                Ваши персональные данные используются только для описанных выше целей и не передаются третьим лицам.

                Мы принимаем необходимые организационные и технические меры для защиты ваших данных от
                несанкционированного доступа, изменения, раскрытия или уничтожения.
            </div>
            <div>
                <h3> 5. Согласие пользователя</h3>
                Оформляя заказ на сайте, вы подтверждаете свое согласие на сбор, обработку и хранение указанных
                персональных данных в соответствии с настоящей Политикой конфиденциальности.
            </div>
            <div>
                <h3>6. Изменения в политике конфиденциальности</h3>
                Мы оставляем за собой право вносить изменения в настоящую Политику конфиденциальности. В случае
                внесения изменений, актуальная версия политики будет опубликована на сайте, и ее применение начнется
                с момента публикации.
            </div>
            <div>
                <h3> 7. Контактная информация</h3>
                Если у вас возникли вопросы по поводу обработки ваших персональных данных или вы хотите
                воспользоваться своими правами, пожалуйста, свяжитесь с нами по телефону +7 (985) 039-00-39.

                Данная Политика конфиденциальности направлена на обеспечение прозрачности использования ваших
                данных
                и соблюдение ваших прав в соответствии с действующим законодательством.
            </div>
        </div>
    )
}