import css from './css.module.css'

export const Terms = ()=> {
    return (
        <div className={css.wrapper}>
            <h2>Политика конфиденциальности сайта Адрес 39</h2>
            <div>
                <h3>1. Общая информация</h3>
                Настоящая Политика конфиденциальности определяет порядок сбора, использования и защиты персональных
                данных пользователей сайта ресторана `Адрес 39`, расположенного по адресу: Москва, проспект Маршала
                Жукова, 39А, корп. 1. Контактный телефон: +7 (985) 039-00-39.
            </div>
            <div>
                <h3>2. Собираемые данные</h3>
                При оформлении заказа на сайте мы собираем следующую информацию:

                Имя и фамилия пользователя;

                Номер телефона;

                Адрес доставки.
            </div>
            <div>
                <h3>3. Цели сбора и использования данных</h3>
                Собранные данные используются исключительно для следующих целей:

                Обработка и выполнение заказа;

                Связь с пользователем по вопросам заказа;

                Доставка заказанной продукции.
            </div>
            <div>
                <h3>4. Использование и защита данных</h3>

                Ваши персональные данные используются только для описанных выше целей и не передаются третьим лицам.

                Мы принимаем необходимые организационные и технические меры для защиты ваших данных от
                несанкционированного доступа, изменения, раскрытия или уничтожения.
            </div>
            <div>
                <h3> 5. Согласие пользователя</h3>
                Оформляя заказ на сайте, вы подтверждаете свое согласие на сбор, обработку и хранение указанных
                персональных данных в соответствии с настоящей Политикой конфиденциальности.
            </div>
            <div>
                <h3>6. Изменения в политике конфиденциальности</h3>
                Мы оставляем за собой право вносить изменения в настоящую Политику конфиденциальности. В случае
                внесения изменений, актуальная версия политики будет опубликована на сайте, и ее применение начнется
                с момента публикации.
            </div>
            <div>
                <h3> 7. Контактная информация</h3>
                Если у вас возникли вопросы по поводу обработки ваших персональных данных или вы хотите
                воспользоваться своими правами, пожалуйста, свяжитесь с нами по телефону +7 (985) 039-00-39.

                Данная Политика конфиденциальности направлена на обеспечение прозрачности использования ваших
                данных
                и соблюдение ваших прав в соответствии с действующим законодательством.
            </div>

            <h2>ПОЛИТИКА ИСПОЛЬЗОВАНИЯ ФАЙЛОВ «COOKIES»</h2>

            <div>
                Настоящая Политика использования файлов «Сookies» (далее — «Политика») разработана и действует в
                отношении файлов «Сookies», которые используются на сайте https://адрес39.рф/ (далее – «Сайт»). Политика
                определяет порядок и условия обработки файлов «Cookies», собираемых и используемых посредством Сайта.
            </div>
            <div>
                Файлы «Cookies» представляют собой небольшие фрагменты информации, которые размещаются или могут быть
                сохранены на Вашем компьютере (или других Интернет-совместимых устройствах, таких как смартфон или
                планшет), в браузере или на просматриваемой веб-странице, когда Вы посещаете Сайт.
            </div>
            <div>Файлы «Cookies» используются с целью улучшения работы Сайта, повышения удобства и эффективности работы
                с Сайтом, улучшения его защиты, для сбора и анализа информации о производительности и использовании
                Сайта, количестве посещений на Сайте, а также для улучшения и индивидуальной настройки предоставления
                информации, повышения степени удовлетворенности работой Сайта, для обеспечения технических возможностей
                полноценного функционирования Сайта, для персонализации контента и сообщений, сбора аналитики и других
                целей.
            </div>
            <div>Более подробную информацию о файлах «Сookies» и принципах их работы можно найти на ресурсе
                <a href={'http://www.aboutcookies.org/.'} target={'_blank'}>http://www.aboutcookies.org/.</a>
            </div>
            <div>При посещении Сайта предоставляется баннер, информирующий об использовании файлов «Cookies» и
                запрашивающий Ваше согласие на использование файлов «Cookies». Нажав кнопку «Хорошо» или продолжая
                использовать Сайт (продолжая находиться на Сайте), Вы соглашаетесь на использование, сбор и размещение
                файлов «Cookies» на Вашем компьютере или ином устройстве, в браузере или на просматриваемой
                веб-странице.
            </div>
            <div>В случае отказа от использования и обработки файлов «Сookies», Вы проинформированы о необходимости
                прекратить дальнейшее использование Сайта или отключить использование файлов «Cookies».
            </div>
            <div>Использование файлов «Cookies» может быть отключено в интернет-обозревателе (в настройках браузера).
                Поскольку средства, с помощью которых можно отказаться от использования/сбора файлов «Сookies» через
                элементы управления браузера, отличаются в зависимости от браузера, для получения дополнительной
                информации следует обратиться к разделу «Справка» используемого браузера или иным соответствующим его
                разделам. При отключении использования файлов «Cookies» возможность использования Сайта сохраняется,
                однако могут быть недоступны или ограничены некоторые функции и(или) веб-страницы Сайта.
            </div>
            <div>Используются два вида файлов «Cookies»:
            </div>
            <div>- временные (сессионные), которые существуют только во время нахождения на странице Сайта, срок действия
                которых истекает (и они удаляются) после закрытия интернет-обозревателя (браузера);

            </div>
            <div>- постоянные (бессрочные), которые удаляются по истечении установленного срока хранения (или через
                определенный промежуток времени) либо хранятся без ограничения срока и при необходимости могут быть
                удалены в любое время пользователем из его компьютера или иного устройства.
            </div>
            <div>В Политику использования файлов «Сookies» периодически могут вноситься изменения или дополнения, в
                связи с чем рекомендуется время от времени вновь осуществлять ознакомление с положениями настоящей
                Политики, в том числе для понимания условий и способов использования файлов «Сookies».
            </div>

        </div>
    )
}